# Problem no 4

**Remove the duplicates and save the first occurance**

In [1]:
import pandas as pd
data=pd.DataFrame({
    "Name": ["John Doe", "Jane Smith", "Alice Johnson", "Bob Brown", "Eve White"],
    "Roll No": [101, 102, 103, 104, 105],
    "Email": ["johndoe@example.com", "janesmith@example.com", "alicej@example.com", "johndoe@example.com", "evewhite@example.com"]
})
print(data)

            Name  Roll No                  Email
0       John Doe      101    johndoe@example.com
1     Jane Smith      102  janesmith@example.com
2  Alice Johnson      103     alicej@example.com
3      Bob Brown      104    johndoe@example.com
4      Eve White      105   evewhite@example.com

In [11]:
data.drop_duplicates(subset=['Email'],keep='first') # it will remove the last occurance

            Name  Roll No                  Email
0       John Doe      101    johndoe@example.com
1     Jane Smith      102  janesmith@example.com
2  Alice Johnson      103     alicej@example.com
4      Eve White      105   evewhite@example.com

In [5]:
data.reset_index()

   index           Name  Roll No                  Email
0      0       John Doe      101    johndoe@example.com
1      1     Jane Smith      102  janesmith@example.com
2      2  Alice Johnson      103     alicej@example.com
3      3      Bob Brown      104    johndoe@example.com
4      4      Eve White      105   evewhite@example.com

In [10]:
data.drop_duplicates(subset=['Email'],keep='last') # it will  remove the first occurance

            Name  Roll No                  Email
1     Jane Smith      102  janesmith@example.com
2  Alice Johnson      103     alicej@example.com
3      Bob Brown      104    johndoe@example.com
4      Eve White      105   evewhite@example.com

In [12]:
data

            Name  Roll No                  Email
0       John Doe      101    johndoe@example.com
1     Jane Smith      102  janesmith@example.com
2  Alice Johnson      103     alicej@example.com
3      Bob Brown      104    johndoe@example.com
4      Eve White      105   evewhite@example.com

In [13]:
# for save the changes we use "inplace = True "

In [14]:
data.drop_duplicates(subset=['Email'],keep='first',inplace=True)

In [15]:
data

            Name  Roll No                  Email
0       John Doe      101    johndoe@example.com
1     Jane Smith      102  janesmith@example.com
2  Alice Johnson      103     alicej@example.com
4      Eve White      105   evewhite@example.com

In [16]:
data.reset_index()

   index           Name  Roll No                  Email
0      0       John Doe      101    johndoe@example.com
1      1     Jane Smith      102  janesmith@example.com
2      2  Alice Johnson      103     alicej@example.com
3      4      Eve White      105   evewhite@example.com

In [24]:
data.loc[3,'index']=3

In [25]:
data

            Name  Roll No                  Email  index
0       John Doe    101.0    johndoe@example.com    NaN
1     Jane Smith    102.0  janesmith@example.com    NaN
2  Alice Johnson    103.0     alicej@example.com    NaN
3      Eve White    105.0   evewhite@example.com    3.0
4            NaN      NaN                    NaN    3.0

In [27]:
data.drop('index',axis=1,inplace=True)

In [28]:
data

            Name  Roll No                  Email
0       John Doe    101.0    johndoe@example.com
1     Jane Smith    102.0  janesmith@example.com
2  Alice Johnson    103.0     alicej@example.com
3      Eve White    105.0   evewhite@example.com
4            NaN      NaN                    NaN

In [30]:
data.drop(4,inplace=True)

In [31]:
data

            Name  Roll No                  Email
0       John Doe    101.0    johndoe@example.com
1     Jane Smith    102.0  janesmith@example.com
2  Alice Johnson    103.0     alicej@example.com
3      Eve White    105.0   evewhite@example.com